#include <stdio.h>
#include <locale.h>
#include <malloc.h> 
#include <time.h>
#include <string.h>
#include <direct.h>

#define LEN 100
//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

// ______________________________________________ОПРЕДЕЛИТЕЛЬ____________________________________________________________________________________________________

//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
int minorDet(int** mat, int** minor, int b, int a, int n)
{

	int c = 0, d = 0;
	for (int i = 0; i < n - 1; i++) 
	{
		if (i == b)
			c = 1;
		for (int j = 0; j < n - 1; j++) 
		{
			if (j == a)
				d = 1;
			minor[i][j] = mat[i + c][j + d];
		}
		d = 0;
	}
}

int DET(int** matrix, int n, int* det) 
{
	if (n == 1) 
	{
		*det = matrix[0][0];
	}
	else if (n == 2) 
	{
		*det = matrix[0][0] * matrix[1][1] - matrix[1][0] * matrix[0][1];
	}
	else if (n == 3)
	{
		*det = matrix[0][0] * matrix[1][1] * matrix[2][2] + matrix[0][1] * matrix[1][2] * matrix[2][0] + matrix[0][2] * matrix[1][0] * matrix[2][1] - matrix[0][2] * matrix[1][1] * matrix[2][0] - matrix[0][0] * matrix[1][2] * matrix[2][1] - matrix[0][1] * matrix[1][0] * matrix[2][2];
	}

	else if (n > 3) 
	{
		int** minor = (int**)malloc((n - 1) * sizeof(int*));
		for (int i = 0; i < n - 1; i++)
			minor[i] = (int*)malloc((n - 1) * sizeof(int));

		for (int j = 0; j < n; j++) 
		{
			minorDet(matrix, minor, 0, j, n);
			int el = matrix[0][j] * DET(minor, (n - 1), det);
			*det += (j % 2 == 0) ? el : -el;
		}

		for (int i = 0; i < n - 1; i++)
			free(minor[i]);
		free(minor);
	}

}

// Нечитаемый код?
// Не проблема!!
// ctrl + F  в помощь!
// нужные тэги ниже
// ---------------------------------------------------------------------------------------------------------------------
// КОЛЛИЧЕСТВО СТРОК И СТОЛБЦОВ В МАТРИЦЕ А  | КОЛЛИЧЕСТВО СТРОК И СТОЛБЦОВ В МАТРИЦЕ В |
// ---------------------------------------------------------------------------------------------------------------------
// ВЫДЕЛЕНИЕ ПАМЯТИ ПОД ПЕРВУЮ МАТРИЦУ  |  ВЫДЕЛЕНИЕ ПАМЯТИ ПОД ВТОРУЮ МАТРИЦУ | ВЫДЕЛЕНИЕ ПАМЯТИ ПОД ПЕРВУЮ МАТРИЦУ |
// ---------------------------------------------------------------------------------------------------------------------
// ВЫВОД ПЕРВОЙ МАТРИЦЫ | ВЫВОД ВТОРОЙ МАТРИЦЫ|
// ---------------------------------------------------------------------------------------------------------------------
// НАЧАЛО РАБОТЫ КАЛЬКУЛЯТОРА |
// ---------------------------------------------------------------------------------------------------------------------
// СЛОЖЕНИЕ | ВЫЧИТАНИЕ | ПРОИЗВЕДЕНИЕ | ТРАНСПОНИРОВАНИЕ | ОПРЕДЕЛИТЕЛЬ |
// ---------------------------------------------------------------------------------------------------------------------

int main()
{
	setlocale(LC_ALL, "Rus");
	char oper;
	int rows1 = 1, cols1 = 0, rows2 = 1, cols2 = 0;
	char per = '\n';
	int schC = 0;
	int num1 = 0, num2 = 0;
	int sch1 = 0, sch2 = 0;
	char mat1[LEN];
	char mat2[LEN];

	int determinant1 = 0;
	int determinant2 = 0;

	_mkdir("RESULT");
	char namefile[50] = { NULL };
	sprintf_s(namefile, sizeof(namefile), "RESULT/RESULT_%d.txt\0", time(NULL));

	// --------------------------------------------------------------------------------------------------------------------------------------------------------
	FILE* f1 = fopen("NUM1.txt", "r");  // <-- Открытие 
	FILE* f2 = fopen("NUM2.txt", "r");  // <-- Открытие 
	FILE* f3 = fopen(namefile, "w");// <-- Открытие 
	// --------------------------------------------------------------------------------------------------------------------------------------------------------


	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// КОЛЛИЧЕСТВО СТРОК И СТОЛБЦОВ В МАТРИЦЕ А

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	while (fscanf_s(f1, "%d", &num1) == 1)
	{
		if (fgetc(f1) == '\n')
		{
			rows1++;
		}
	}
	fseek(f1, 0, 0);
	while (fscanf_s(f1, "%d", &num1) == 1)
	{
		cols1++;
		if (fgetc(f1) == '\n')
			break;
	}
	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// КОЛЛИЧЕСТВО СТРОК И СТОЛБЦОВ В МАТРИЦЕ В

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	while (fscanf_s(f2, "%d", &num2) == 1)
	{
		if (fgetc(f2) == '\n')
		{
			rows2++;
		}
	}
	fseek(f2, 0, 0);
	while (fscanf_s(f2, "%d", &num2) == 1)
	{
		cols2++;
		if (fgetc(f2) == '\n')
			break;
	}

	printf("Колличестиво строк и столбцов в матрице А: \n");
	printf("{");
	printf("%d, ", rows1);
	printf("%d", cols1);
	printf("}");
	printf("\n");
	printf("Колличестиво строк и столбцов в матрице B: \n");
	printf("{");
	printf("%d, ", rows2);
	printf("%d", cols2);
	printf("}");
	printf("\n");
	printf("\n");

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// ВЫДЕЛЕНИЕ ПАМЯТИ ПОД ПЕРВУЮ МАТРИЦУ 

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	int** matrix1 = (int**)malloc(rows1 * sizeof(int*));

	if (matrix1 == NULL)
	{
		printf("Не выделилась броу...");
	}
	for (int i = 0; i < rows1; i++)
	{
		matrix1[i] = (int*)malloc(cols1 * sizeof(int));

		if (matrix1[i] == NULL)
		{
			printf("Не выделилась броу...");
		}
	}
	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// ВЫДЕЛЕНИЕ ПАМЯТИ ПОД ВТОРУЮ МАТРИЦУ 

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	int** matrix2 = (int**)malloc(rows2 * sizeof(int*));

	if (matrix2 == NULL)
	{
		printf("Не выделилась броу...");
	}
	for (int i = 0; i < rows2; i++)
	{
		matrix2[i] = (int*)malloc(cols2 * sizeof(int));

		if (matrix2[i] == NULL)
		{
			printf("Не выделилась броу...");
		}
	}
	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// ВЫДЕЛЕНИЕ ПАМЯТИ ПОД РЕЗУЛЬТАТ ВЫЧИСЛЕНИЯ  

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	int** result = (int**)malloc(rows1 * sizeof(int*));

	if (result == NULL)
	{
		printf("Не выделилась броу...");
	}
	for (int i = 0; i < rows1; i++)
	{
		result[i] = (int*)malloc(cols2 * sizeof(int));

		if (matrix1[i] == NULL)
		{
			printf("Не выделилась броу...");
		}
	}
	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// ВЫВОД ПЕРВОЙ МАТРИЦЫ

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	if (NULL != f1)
	{
		fseek(f1, 0, 0);//--------

		printf("Матрица А:\n\n");
		while (!feof(f1))
		{

			if (fgets(mat1, LEN, f1) != 0)
				printf("%s", mat1);

		}


		printf("\n");
		printf("\n");

	}
	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	// ВЫВОД ВТОРОЙ МАТРИЦЫ

	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	if (NULL != f2)
	{
		fseek(f2, 0, 0);//--------

		printf("Матрица В:\n\n");
		while (!feof(f2))
		{
			if (fgets(mat2, LEN, f2) != 0)
				printf("%s", mat2);

		}

		printf("\n");
	}
	// ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	//________________________________________НАЧАЛО РАБОТЫ КАЛЬКУЛЯТОРА____________________________________________________________________________________________

	// ______________________________________________СЛОЖЕНИЕ_________________________________________________________________________________________________________

	//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	printf("\n");
	printf("Какую операцию совершить над матрицами?\n");
	printf("Сложение(+),Вычитание(-),Произведение(*),Транспонирование(t),Поиск оприделителя(d)\n");
	printf("--> ");
	scanf_s("%c", &oper);

	switch (oper)
	{
		case '+':
			if ((rows1 == rows2) && (cols1 == cols2))
			{
				if (NULL != f1 && NULL != f2)
				{
					sch1 = 0;
					schC = 0;
					fseek(f1, 0, 0); //--------
					fseek(f2, 0, 0); //--------
					printf("\nA + B: \n\n");

					while ((!feof(f1)) && (!feof(f2)))
					{
						for (int i = 0; i < rows1; i++)// Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
						{
							for (int j = 0; j < cols1; j++)
							{
								fscanf_s(f1, "%d", &num1);
								fscanf_s(f2, "%d", &num2);
								matrix1[i][j] = num1;
								matrix2[i][j] = num2;
								result[i][j] = matrix1[i][j] + matrix2[i][j];

								sch1++;
								if (j == cols1 - 1)
									schC++;
								printf("%d ", result[i][j]);
								if (sch1 == cols1 * schC)
									printf("\n");
							}
						}
					}

					fprintf(f3, "%s", "A + B:\n");
					fprintf(f3, "%s", "\n");

					sch2 = 0;
					schC = 0;
					for (int i = 0; i < rows1; i++) // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
					{
						schC++;
						for (int j = 0; j < cols1; j++)
						{
							sch2++;
							fprintf(f3, "%d ", result[i][j]);
							if (sch2 == cols1 * schC)
								fprintf(f3, "%c", per);
						}
					}
				}   fprintf(f3, "%s", "\n");
			}
			else
			{
				printf("\nA + B: \n\n");
				fprintf(f3, "%s", "A + B:\n");
				fprintf(f3, "%s", "\nНевозможно посчитать сумму матриц А и В\n\n");
				printf("Невозможно посчитать сумму матриц А и В\n");
		    }
			break;
		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

		// ______________________________________________ВЫЧИТАНИЕ_____________________________________________________________________________________________

		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		case '-':
			if ((rows1 == rows2) && (cols1 == cols2))
			{
				if (NULL != f1 && NULL != f2)
				{
					sch1 = 0;
					schC = 0;

					fseek(f1, 0, 0); //--------
					fseek(f2, 0, 0); //--------

					printf("\nA - B: \n\n");

					while ((!feof(f1)) && (!feof(f2)))
					{
						for (int i = 0; i < rows1; i++)// Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
						{
							for (int j = 0; j < cols1; j++)
							{
								fscanf_s(f1, "%d", &num1);
								fscanf_s(f2, "%d", &num2);
								matrix1[i][j] = num1;
								matrix2[i][j] = num2;
								result[i][j] = matrix1[i][j] - matrix2[i][j];

								sch1++;
								if (j == cols1 - 1)
									schC++;

								printf("%d ", result[i][j]);
								if (sch1 == cols1 * schC)
									printf("\n");
							}
						}
					}

					fprintf(f3, "%s", "A - B:\n");
					fprintf(f3, "%s", "\n");
					sch2 = 0;
					schC = 0;
					for (int i = 0; i < rows1; i++) // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
					{
						schC++;
						for (int j = 0; j < cols1; j++)
						{
							sch2++;
							fprintf(f3, "%d ", result[i][j]);
							if (sch2 == cols1 * schC)
								fprintf(f3, "%c", per);

						}
					}
				}   fprintf(f3, "%s", "\n");
			}
			else
			{
				printf("\nA - B: \n\n");
				fprintf(f3, "%s", "A - B:\n");
				fprintf(f3, "%s", "\nНевозможно посчитать разность матриц А и В\n");
				printf("Невозможно посчитать разность матриц А и В\n");
			}
			break;
		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

		// ______________________________________________ПРОИЗВЕДЕНИЕ___________________________________________________________________________________________

		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		case '*':
			if (cols1 == rows2)
			{
				if (NULL != f1 && NULL != f2)
				{
					sch1 = 0;
					schC = 0;
					fseek(f1, 0, 0); //--------
					fseek(f2, 0, 0); //--------
					printf("\nA * B: \n\n");

					while ((!feof(f1)) && (!feof(f2)))
					{
						for (int i = 0; i < rows1; i++) // Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
						{
							for (int j = 0; j < cols1; j++)
							{
								fscanf_s(f1, "%d", &num1);
								matrix1[i][j] = num1;
							}
						}
						for (int i = 0; i < rows2; i++) // Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
						{
							for (int j = 0; j < cols2; j++)
							{
								fscanf_s(f2, "%d", &num2);
								matrix2[i][j] = num2;
							}
						}
						for (int i = 0; i < rows1; i++)
						{
							for (int j = 0; j < cols2; j++)
							{
								result[i][j] = 0;
								for (int k = 0; k < rows2; k++)
								{
									result[i][j] += matrix1[i][k] * matrix2[k][j];
								}
							}
						}

						for (int i = 0; i < rows1; i++)
						{
							for (int j = 0; j < cols2; j++)
							{
								sch1++;
								if (j == cols2 - 1)
									schC++;
								printf("%d ", result[i][j]);
								if (sch1 == cols2 * schC)
									printf("\n");

							}
						}

					}
					fprintf(f3, "%s", "A * B:\n");
					fprintf(f3, "%s", "\n");
					sch2 = 0;
					schC = 0;
					for (int i = 0; i < rows1; i++) // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
					{
						schC++;
						for (int j = 0; j < cols2; j++)
						{
							sch2++;
							fprintf(f3, "%d ", result[i][j]);
							if (sch2 == cols2 * schC)
								fprintf(f3, "%c", per);

						}
					}
				}
			}
			else
			{
				printf("\nA * B: \n\n");
				fprintf(f3, "%s", "\nA * B:\n");
				fprintf(f3, "%s", "\nНевозможно посчитать произведение матриц А и В\n");
				printf("Невозможно посчитать проиведение матриц А и В\n");
			}
			break;
		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

		// ______________________________________________ТРАНСПОНИРОВАНИЕ________________________________________________________________________________________

		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		case 't':
			if (NULL != f1 && NULL != f2)
			{
				fseek(f1, 0, 0); //--------
				fseek(f2, 0, 0); //--------
				while ((!feof(f1)) && (!feof(f2)))
				{
					for (int i = 0; i < rows1; i++) // Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
					{
						for (int j = 0; j < cols1; j++)
						{
							fscanf_s(f1, "%d", &num1);
							matrix1[i][j] = num1;
						}
					}
					for (int i = 0; i < rows2; i++) // Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
					{
						for (int j = 0; j < cols2; j++)
						{
							fscanf_s(f2, "%d", &num2);
							matrix2[i][j] = num2;
						}
					}

					printf("\n(A)t: \n\n");
					sch1 = 0;
					schC = 0;
					for (int i = 0; i < cols1; i++)
					{
						schC++;
						for (int j = 0; j < rows1; j++)
						{
							sch1++;
							printf("%d ", matrix1[j][i]);
							if (sch1 == rows1 * schC)
								printf("\n");
						}
					}

					printf("\n(B)t: \n\n");
					sch1 = 0;
					schC = 0;
					for (int i = 0; i < cols2; i++)
					{
						schC++;
						for (int j = 0; j < rows2; j++)
						{
							sch1++;
							printf("%d ", matrix2[j][i]);
							if (sch1 == rows2 * schC)
								printf("\n");
						}
					}
					fprintf(f3, "%s", "(A)t:\n");
					fprintf(f3, "%s", "\n");
					sch2 = 0;
					schC = 0;
					for (int i = 0; i < cols1; i++) // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
					{
						schC++;
						for (int j = 0; j < rows1; j++)
						{
							sch2++;
							fprintf(f3, "%d ", matrix1[j][i]);
							if (sch2 == rows1 * schC)
								fprintf(f3, "%c", per);

						}
					}
					fprintf(f3, "%s", "(B)t:\n");
					fprintf(f3, "%s", "\n");
					sch2 = 0;
					schC = 0;
					for (int i = 0; i < cols2; i++) // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
					{
						schC++;
						for (int j = 0; j < rows2; j++)
						{
							sch2++;
							fprintf(f3, "%d ", matrix2[j][i]);
							if (sch2 == rows2 * schC)
								fprintf(f3, "%c", per);
						}
					}
					fprintf(f3, "%s", "\n");
				}
			}
			break;
		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

		// ______________________________________________ОПРЕДЕЛИТЕЛЬ_____________________________________________________________________________________________

		//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
		case 'd':

			if (NULL != f1 && NULL != f2)
			{
				fseek(f1, 0, 0); //--------
				fseek(f2, 0, 0); //--------
				while ((!feof(f1)) && (!feof(f2)))
				{
					for (int i = 0; i < rows1; i++) // Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
					{
						for (int j = 0; j < cols1; j++)
						{
							fscanf_s(f1, "%d", &num1);
							matrix1[i][j] = num1;
						}
					}
					for (int i = 0; i < rows2; i++) // Считывание из файла -_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_-_
					{
						for (int j = 0; j < cols2; j++)
						{
							fscanf_s(f2, "%d", &num2);
							matrix2[i][j] = num2;
						}
					}
				}
			}
			printf("\n");
	
			if (cols1 == rows1)
			{
				printf("det(A) = ");
				DET(matrix1, rows1, &determinant1);
				printf("%d", determinant1);
				   
				fprintf(f3, "%s", "det(A) = ");  // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
				fprintf(f3, "%d", determinant1);
			}
			else
			{
				printf("!!!Невозможно посчитать детерминант матрицы А!!!");
				fprintf(f3, "%s", "!!!Невозможно посчитать детерминант матрицы А!!!");
				fprintf(f3, "%s", "\n");
			}
			
			printf("\n");
			printf("\n");

			if (cols2 == rows2)
			{
				printf("det(B) = ");
				DET(matrix2, rows2, &determinant2);
				printf("%d", determinant2);
				printf("\n");
				
				fprintf(f3, "%s", "\n");
				fprintf(f3, "%s", "\n");
				fprintf(f3, "%s", "det(B) = "); // Ввод результата в файл RESULT.txt <><><><><><><><><><><><><><><><><><>
				fprintf(f3, "%d", determinant2);
			}
			else
			{
				printf("!!!Невозможно посчитать детерминант матрицы В!!!");
				fprintf(f3, "%s", "!!!Невозможно посчитать детерминант матрицы B!!!");
			}
			printf("\n");
		
			break;
			
		default:
			printf("\n!!! Неккоректный ввод !!!\n");
			fprintf(f3, "%s", "\n!!!Неккоректный ввод !!!\n");
			break;
	}
	//-------------------------------------------------------------------------------------------------------------------------------------------------------------
	fclose(f1); // <-- Закрытие 
	fclose(f2); // <-- Закрытие 
	fclose(f3); // <-- Закрытие 
	// ----------------------------------------------------------------------------------------------------------------------------------------------------------
	
	return 0;
}